print(456)
print("kujhgrdso")
a = 5
b = 5

print(id (a), id (b)) # функция указывает идентификатор объекта, на который ссылается указанная переменная

5 / 2 # деление = 2.5
5 * 2 # умножение = 10
5 // 2 # целочисленное деление = 2.0
5 % 2 # остаток от деления = 1
5 ** 2 # возведение в степень, 5 в степени 2 = 25

          # математические функции
abs(-5)
c = abs( -5 )      # функция для вычисления модуля числа
print (c) # = 5
min (1, 2, 3 ,-4)  # функция выбора минимального числа среди переданных ей чисел     
max (1, 2, 5, 8)   # функция выбора максимального числа среди переданных ей чисел 
d = min (1, 2, 3 ,-4) 
print (d)

pow (6, 2)          # функция возведения в квадрат ( 6 в степени 2) аналог 6**2
e = pow (6,2)
print (e)
pow(49, 0.5)        # квадратный корень из 49, результат 7
pow(27, 1/3)        # кубический корень из 27, результат 3  

round(0.5)          # функция округления до ближайшего целого числа 
round(10.578, 2)    # округляет до сотых (число знаков после запятой) = 10.58
round (7854.124, -2)  # округляет до сотен (число знаков до запятой)  = 7900
print (round (7854.124, -2))
